apache/nuttx/arch/arm/src/stm32l4/stm32l4_adc.c
#ifdef CONFIG_PM
  struct pm_callback_s pm_callback;
#endif

#ifdef ADC_HAVE_DMA
  DMA_HANDLE dma;       /* Allocated DMA channel */

  /* DMA transfer buffer */

  uint16_t *r_dmabuffer;
#endif

  /* List of selected ADC channels to sample */

  uint8_t  r_chanlist[CONFIG_STM32_ADC_MAX_SAMPLES];

#ifdef ADC_HAVE_INJECTED
  /* List of selected ADC injected channels to sample */

  uint8_t  j_chanlist[ADC_INJ_MAX_SAMPLES];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* ADC Register access */

static void stm32_modifyreg32(unsigned int addr, uint32_t clrbits,
                              uint32_t setbits);
static uint32_t adc_getreg(struct stm32_dev_s *priv, int offset);
static void     adc_putreg(struct stm32_dev_s *priv, int offset,
                           uint32_t value);
static void     adc_modifyreg(struct stm32_dev_s *priv, int offset,
                              uint32_t clrbits, uint32_t setbits);
static void     adc_dumpregs(struct stm32_dev_s *priv);

#ifdef ADC_HAVE_TIMER
static uint16_t tim_getreg(struct stm32_dev_s *priv, int offset);
static void     tim_putreg(struct stm32_dev_s *priv, int offset,
                           uint16_t value);
static void     tim_modifyreg(struct stm32_dev_s *priv, int offset,
                              uint16_t clrbits, uint16_t setbits);
static void     tim_dumpregs(struct stm32_dev_s *priv,
                             const char *msg);
#endif

/* ADC Miscellaneous Helpers */

static void     adc_rccreset(struct stm32_dev_s *priv, bool reset);
static void     adc_enable(struct stm32_dev_s *priv);
static uint32_t adc_sqrbits(struct stm32_dev_s *priv, int first,
                            int last, int offset);
static int      adc_set_ch(struct adc_dev_s *dev, uint8_t ch);
#ifdef ADC_HAVE_INJECTED
static int      adc_inj_set_ch(struct adc_dev_s *dev, uint8_t ch);
#endif
static bool     adc_internal(struct stm32_dev_s * priv,
                             uint32_t *adc_ccr);
#ifdef HAVE_ADC_RESOLUTION
static int      adc_resolution_set(struct adc_dev_s *dev, uint8_t res);
#endif
static void     adc_sample_time_set(struct adc_dev_s *dev);
static void     adc_startconv(struct stm32_dev_s *priv, bool enable);
#ifdef ADC_HAVE_INJECTED
static void     adc_inj_startconv(struct stm32_dev_s *priv, bool enable);
#endif
#ifdef ADC_HAVE_TIMER
static void     adc_timstart(struct stm32_dev_s *priv, bool enable);
static int      adc_timinit(struct stm32_dev_s *priv);
#endif
#ifdef ADC_HAVE_DMA
static void     adc_dma_cfg(struct stm32_dev_s *priv);
static void     adc_dma_start(struct adc_dev_s *dev);
#  ifndef CONFIG_STM32_ADC_NOIRQ
static void     adc_dmaconvcallback(DMA_HANDLE handle, uint8_t isr,
                                    void *arg);
#  endif
#endif
#if defined(ADC_HAVE_DFSDM) || defined(CONFIG_STM32_ADC_LL_OPS)
static int      adc_offset_set(struct stm32_dev_s *priv, uint8_t ch,
                               uint8_t i, uint16_t offset);
#endif
#ifdef ADC_HAVE_EXTCFG
static int      adc_extsel_set(struct stm32_dev_s *priv,
                               uint32_t extcfg);
#endif
#ifdef ADC_HAVE_JEXTCFG
static int      adc_jextsel_set(struct stm32_dev_s *priv,
                                uint32_t jextcfg);
#endif

#ifdef CONFIG_PM
static int      adc_pm_prepare(struct pm_callback_s *cb, int domain,
                          enum pm_state_e state);
#endif

#ifdef CONFIG_STM32_ADC_LL_OPS
static void     adc_llops_intack(struct stm32_adc_dev_s *dev,
                                 uint32_t source);
static void     adc_llops_inten(struct stm32_adc_dev_s *dev,
                                uint32_t source);
static void     adc_llops_intdis(struct stm32_adc_dev_s *dev,
                                 uint32_t source);
static uint32_t adc_llops_intget(struct stm32_adc_dev_s *dev);
static uint32_t adc_llops_regget(struct stm32_adc_dev_s *dev);
static void     adc_llops_startconv(struct stm32_adc_dev_s *dev,
                                    bool enable);
static int      adc_llops_offset_set(struct stm32_adc_dev_s *dev,
                                     uint8_t ch, uint8_t i, uint16_t offset);
#  ifdef ADC_HAVE_DMA
static int      adc_regbufregister(struct stm32_adc_dev_s *dev,
                                   uint16_t *buffer, uint16_t len);
static void     adc_llops_dma_start(struct stm32_adc_dev_s *adc,
                                   dma_callback_t callback,
                                   uint16_t *buffer, uint16_t len);
static void     adc_llops_dma_stop(struct stm32_adc_dev_s *adc);
#  endif
#  ifdef ADC_HAVE_EXTCFG
static int      adc_llops_extsel_set(struct stm32_adc_dev_s *dev,
                                     uint32_t extcfg);
#  endif
#  ifdef ADC_HAVE_JEXTCFG
static void     adc_llops_jextsel_set(struct stm32_adc_dev_s *dev,
                                      uint32_t jextcfg);
#  endif
static void     adc_llops_dumpregs(struct stm32_adc_dev_s *dev);
#  ifdef ADC_HAVE_INJECTED
static uint32_t adc_llops_injget(struct stm32_adc_dev_s *dev,
                                 uint8_t chan);
static void     adc_llops_inj_startconv(struct stm32_adc_dev_s *dev,
                                        bool enable);
#  endif
#endif /* CONFIG_STM32_ADC_LL_OPS */

/* ADC Interrupt Handler */

#ifndef CONFIG_STM32_ADC_NOIRQ
static int adc_interrupt(struct adc_dev_s *dev, uint32_t regval);
#  if defined(CONFIG_STM32_ADC1) || defined(CONFIG_STM32_ADC2)
static int adc12_interrupt(int irq, void *context, void *arg);
#  endif
#  if defined(CONFIG_STM32_ADC3)
static int adc3_interrupt(int irq, void *context, void *arg);
#  endif
#endif /* CONFIG_STM32_ADC_NOIRQ */

/* ADC Driver Methods */

static int  adc_bind(struct adc_dev_s *dev,
                     const struct adc_callback_s *callback);
static void adc_reset(struct adc_dev_s *dev);
static int  adc_setup(struct adc_dev_s *dev);
static void adc_shutdown(struct adc_dev_s *dev);
static void adc_rxint(struct adc_dev_s *dev, bool enable);
static int  adc_ioctl(struct adc_dev_s *dev, int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ADC interface operations */

static const struct adc_ops_s g_adcops =
{
  .ao_bind        = adc_bind,
  .ao_reset       = adc_reset,
  .ao_setup       = adc_setup,
  .ao_shutdown    = adc_shutdown,
  .ao_rxint       = adc_rxint,
  .ao_ioctl       = adc_ioctl,
};

