apache/nuttx/arch/arm/src/stm32l4/stm32l4_adc.c
#ifdef CONFIG_STM32_ADC_LL_OPS

/****************************************************************************
 * Name: adc_llops_intack
 ****************************************************************************/

static void adc_llops_intack(struct stm32_adc_dev_s *dev,
                             uint32_t source)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  /* Clear pending interrupts */

  adc_putreg(priv, STM32_ADC_ISR_OFFSET, (source & ADC_ISR_ALLINTS));
}

/****************************************************************************
 * Name: adc_llops_inten
 ****************************************************************************/

static void adc_llops_inten(struct stm32_adc_dev_s *dev,
                            uint32_t source)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  /* Enable interrupts */

  adc_modifyreg(priv, STM32_ADC_IER_OFFSET, 0, (source & ADC_IER_ALLINTS));
}

/****************************************************************************
 * Name: adc_llops_intdis
 ****************************************************************************/

static void adc_llops_intdis(struct stm32_adc_dev_s *dev,
                             uint32_t source)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  /* Disable interrupts */

  adc_modifyreg(priv, STM32_ADC_IER_OFFSET, (source & ADC_IER_ALLINTS), 0);
}

/****************************************************************************
 * Name: adc_llops_intget
 ****************************************************************************/

static uint32_t adc_llops_intget(struct stm32_adc_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;
  uint32_t regval;
  uint32_t pending;

  regval  = adc_getreg(priv, STM32_ADC_ISR_OFFSET);
  pending = regval & ADC_ISR_ALLINTS;

  return pending;
}

/****************************************************************************
 * Name: adc_llops_regget
 ****************************************************************************/

static uint32_t adc_llops_regget(struct stm32_adc_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  return adc_getreg(priv, STM32_ADC_DR_OFFSET) & ADC_DR_MASK;
}

/****************************************************************************
 * Name: adc_llops_startconv
 ****************************************************************************/

static void adc_llops_startconv(struct stm32_adc_dev_s *dev, bool enable)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  adc_startconv(priv, enable);
}

/****************************************************************************
 * Name: adc_llops_offset_set
 ****************************************************************************/

static int  adc_llops_offset_set(struct stm32_adc_dev_s *dev, uint8_t ch,
                                 uint8_t i, uint16_t offset)
{
  int ret;

  ret = adc_offset_set((struct stm32_dev_s *)dev, ch, i, offset);

  return ret;
}

/****************************************************************************
 * Name: adc_llops_jextsel_set
 ****************************************************************************/

#ifdef ADC_HAVE_JEXTCFG
static void  adc_llops_jextsel_set(struct stm32_adc_dev_s *dev,
                                   uint32_t jextcfg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  adc_jextsel_set(priv, jextcfg);
}
#endif

/****************************************************************************
 * Name: adc_regbufregister
 ****************************************************************************/

#ifdef ADC_HAVE_DMA
static int adc_regbufregister(struct stm32_adc_dev_s *dev,
                              uint16_t *buffer, uint16_t len)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  stm32_dmasetup(priv->dma,
                 priv->base + STM32_ADC_DR_OFFSET,
                 (uint32_t)buffer,
                 len,
                 ADC_DMA_CONTROL_WORD);

  /* No DMA callback */

  stm32_dmastart(priv->dma, NULL, dev, false);

  return OK;
}

/****************************************************************************
 * Name: adc_llops_dma_start
 ****************************************************************************/

static void adc_llops_dma_start(struct stm32_adc_dev_s *adc,
                                dma_callback_t callback,
                                uint16_t *buffer, uint16_t len)
{
  struct stm32_dev_s *dev = (struct stm32_dev_s *)adc;

  /* Stop and free DMA if it was started before */

  if (dev->dma != NULL)
    {
      stm32_dmastop(dev->dma);
      stm32_dmafree(dev->dma);
    }

  dev->dma = stm32_dmachannel(dev->dmachan);

  stm32_dmasetup(dev->dma,
                   dev->base + STM32_ADC_DR_OFFSET,
                   (uint32_t)buffer,
                   len,
                   ADC_DMA_CONTROL_WORD);

  stm32_dmastart(dev->dma, callback, dev, false);
}

/****************************************************************************
 * Name: adc_llops_dma_stop
 ****************************************************************************/

static void adc_llops_dma_stop(struct stm32_adc_dev_s *adc)
{
  struct stm32_dev_s *dev = (struct stm32_dev_s *)adc;

  /* Stop and free DMA */

  if (dev->dma != NULL)
    {
      stm32_dmastop(dev->dma);
      stm32_dmafree(dev->dma);
    }
}

#endif /* ADC_HAVE_DMA */

/****************************************************************************
 * Name: adc_llops_extsel_set
 ****************************************************************************/

#ifdef ADC_HAVE_EXTCFG
static int  adc_llops_extsel_set(struct stm32_adc_dev_s *dev,
                                 uint32_t extcfg)
{
  int ret;

  ret = adc_extsel_set((struct stm32_dev_s *)dev, extcfg);

  return ret;
}
#endif

/****************************************************************************
 * Name: adc_llops_injget
 ****************************************************************************/

