apache/nuttx/arch/arm/src/stm32l4/stm32l4_adc.c
#ifdef ADC_HAVE_INJECTED
static uint32_t adc_llops_injget(struct stm32_adc_dev_s *dev,
                                 uint8_t chan)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;
  uint32_t regval = 0;

  if (chan > priv->cjchannels - 1)
    {
      /* REVISIT: return valute with MSB set to indicate error ? */

      goto errout;
    }

  regval = adc_getreg(priv, STM32_ADC_JDR1_OFFSET + (4 * chan)) &
                      ADC_JDR_MASK;

errout:
  return regval;
}

/****************************************************************************
 * Name: adc_llops_inj_startconv
 ****************************************************************************/

static void adc_llops_inj_startconv(struct stm32_adc_dev_s *dev,
                                    bool enable)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  adc_inj_startconv(priv, enable);
}

#endif /* ADC_HAVE_INJECTED */

/****************************************************************************
 * Name: adc_llops_dumpregs
 ****************************************************************************/

static void adc_llops_dumpregs(struct stm32_adc_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  adc_dumpregs(priv);
}

#endif /* CONFIG_STM32_ADC_LL_OPS */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_adc_initialize
 *
 * Description:
 *   Initialize the ADC.
 *
 *   The logic allow initialize ADC regular and injected channels.
 *
 *   The number of injected channels for given ADC is selected from Kconfig
 *   with CONFIG_STM32_ADCx_INJECTED_CHAN definitions
 *
 *   The number of regular channels is obtained from the equation:
 *
 *     cr_channels = channels - cj_channels
 *
 *   where:
 *     cr_channels - regular channels
 *     cj_channels - injected channels
 *     channels    - this function parameter
 *
 *   The chanlist array store both regular channels and injected channels
 *   configuration so that regular channels are the first in order:
 *
 *     # regular channels start from here
 *     chanlist[0]                  -> ADC_SQRx_SQ1
 *     chanlist[1]                  -> ADC_SQRx_SQ2
 *     ...
 *     # injected channels start from here
 *     chanlist[channels - (y - 1)] -> ADC_JSQR_JSQ1
 *     ...
 *     chanlist[channels]           -> ADC_JSQR_ISQy
 *
 *   where:
 *      y = CONFIG_STM32_ADCx_INJECTED_CHAN, and y > 0
 *
 *   If CONFIG_STM32_ADCx_INJECTED_CHAN = 0, then all channels from
 *   chanlist are regular channels.
 *
 * Input Parameters:
 *   intf      - Could be {1,2,3,4} for ADC1, ADC2, ADC3 or ADC4
 *   chanlist  - The list of channels (regular + injected)
 *   channels  - Number of channels (regular + injected)
 *
 * Returned Value:
 *   Valid ADC device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct adc_dev_s *stm32_adc_initialize(int intf, const uint8_t *chanlist,
                                       int cchannels)
{
  struct adc_dev_s   *dev;
  struct stm32_dev_s *priv;
  uint8_t                crchannels = 0;
  uint8_t                cjchannels = 0;
#ifdef ADC_HAVE_INJECTED
  uint8_t            *j_chanlist = NULL;
#endif

  switch (intf)
    {
#ifdef CONFIG_STM32_ADC1
      case 1:
        {
          ainfo("ADC1 selected\n");
          cjchannels = CONFIG_STM32_ADC1_INJ_CHAN;
          crchannels = cchannels - cjchannels;
          ainfo("  Reg. chan: %d Inj chan: %d\n", crchannels, cjchannels);
#  ifdef ADC_HAVE_INJECTED
          if (cjchannels > 0)
            {
              j_chanlist  = (uint8_t *)chanlist + crchannels;
            }

#  endif
          dev = &g_adcdev1;
        }

      break;
#endif
#ifdef CONFIG_STM32_ADC2
      case 2:
        {
          ainfo("ADC2 selected\n");
          cjchannels = CONFIG_STM32_ADC2_INJ_CHAN;
          crchannels = cchannels - cjchannels;
          ainfo("  Reg. chan: %d Inj chan: %d\n", crchannels, cjchannels);
#  ifdef ADC_HAVE_INJECTED
          if (cjchannels > 0)
            {
              j_chanlist  = (uint8_t *)chanlist + crchannels;
            }

#  endif
          dev = &g_adcdev2;
        }

      break;
#endif
#ifdef CONFIG_STM32_ADC3
      case 3:
        {
          ainfo("ADC3 selected\n");
          cjchannels = CONFIG_STM32_ADC3_INJ_CHAN;
          crchannels = cchannels - cjchannels;
          ainfo("  Reg. chan: %d Inj chan: %d\n", crchannels, cjchannels);
#  ifdef ADC_HAVE_INJECTED
          if (cjchannels > 0)
            {
              j_chanlist  = (uint8_t *)chanlist + crchannels;
            }

#  endif
          dev = &g_adcdev3;
        }

      break;
#endif
      default:
        aerr("ERROR: No ADC interface defined\n");
        return NULL;
    }

  /* Configure the selected ADC */

  priv = (struct stm32_dev_s *)dev->ad_priv;

  DEBUGASSERT(crchannels <= CONFIG_STM32_ADC_MAX_SAMPLES);
  if (crchannels > CONFIG_STM32_ADC_MAX_SAMPLES)
    {
      crchannels = CONFIG_STM32_ADC_MAX_SAMPLES;
    }

  priv->cchannels = crchannels;
  memcpy(priv->r_chanlist, chanlist, crchannels);

#ifdef ADC_HAVE_INJECTED
  /* Configure injected channels */

  DEBUGASSERT(cjchannels <= ADC_INJ_MAX_SAMPLES);

  priv->cjchannels = cjchannels;
  memcpy(priv->j_chanlist, jchanlist, cjchannels);

#endif

#ifndef CONFIG_STM32_ADC_NOIRQ
  priv->cb = NULL;
#endif

#ifdef CONFIG_PM
  if (pm_register(&priv->pm_callback) != OK)
    {
      aerr("Power management registration failed\n");
      return NULL;
    }
#endif

  return dev;
}

#endif /* CONFIG_STM32_ADC1 || CONFIG_STM32_ADC2 || CONFIG_STM32_ADC3 */
#endif /* CONFIG_ADC */
